//Визначити, чи є задане ціле число простим
int main()
{
	#define NUM 14 //Задаємо число
	//Визначаємо чи є задане число простим
	int number = 1; //Вводимо змінну для перевірки, якщо число просте, то результат буде 1, якщо ні результат = 0
	if (NUM <= 1){ //Якщо задане число меньше або дорівнює 1, то число не є простим
		number = 0;
	}
	if (NUM == 2 || NUM == 3){ //Якщо число дорівнює 2 або 3, то число є простим
		number = 1;
	}
	if (NUM % 2 == 0){ //Якщо при діленні з остачею на 2 дорівнює 0, то число не є простим
		number = 0;
	}
	for (int i = 3; i <= NUM / 2; i+=2){ // 
		if (NUM % i == 0){
			number = 0;
		}
	}
	return 0;
}
